In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
visa_df=pd.read_csv(r"C:\Users\HP\OneDrive\Documents\data files\Visadataset.csv")
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [5]:
bank_df=pd.read_csv(r"C:\Users\HP\Downloads\bank (2).csv",sep=';')
bank_df

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

- shape
- size
- len
- columns
- dtypes
- isnull
- info

In [4]:
visa_df.dtypes

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

✅ निष्कर्ष:
जब आप df.dtypes लिखते हैं, तो वह एक Series return करता है।

Series के नीचे जो dtype: object लिखा है, वह उस Series का data type है — न कि DataFrame के किसी column का।

In [5]:
type(visa_df)

pandas.core.frame.DataFrame

In [6]:
type(visa_df.dtypes)

pandas.core.series.Series

| Expression       | Output Type                             | क्या देता है?                 |
| ---------------- | --------------------------------------- | ----------------------------- |
| `visa_df`        | `<class 'pandas.core.frame.DataFrame'>` | पूरा DataFrame                |
| `visa_df.dtypes` | `<class 'pandas.core.series.Series'>`   | हर कॉलम का data type (Series) |

- series looks like dataframe
- dataframe has column names matrix kind
- Series only index and its value
- series like a dictionary key and values

In [7]:
visa_df.dtypes.keys()

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [ ]:
| Code                    | Output                         | Type   |
| ----------------------- | ------------------------------ | ------ |
| `visa_df.dtypes`        | Series with dtype info         | Series |
| `visa_df.dtypes.keys()` | Series के Index (column names) | Index  |
यह आपके DataFrame के सारे column names को दिखाता है — क्योंकि visa_df.dtypes एक Series है, जिसमें:

Index = column names

Values = हर column का data type

In [8]:
visa_df.dtypes.values

array([dtype('O'), dtype('O'), dtype('O'), dtype('O'), dtype('O'),
       dtype('int64'), dtype('int64'), dtype('O'), dtype('float64'),
       dtype('O'), dtype('O'), dtype('O')], dtype=object)

In [9]:
list(visa_df.dtypes.items())

[('case_id', dtype('O')),
 ('continent', dtype('O')),
 ('education_of_employee', dtype('O')),
 ('has_job_experience', dtype('O')),
 ('requires_job_training', dtype('O')),
 ('no_of_employees', dtype('int64')),
 ('yr_of_estab', dtype('int64')),
 ('region_of_employment', dtype('O')),
 ('prevailing_wage', dtype('float64')),
 ('unit_of_wage', dtype('O')),
 ('full_time_position', dtype('O')),
 ('case_status', dtype('O'))]

In [ ]:
| Code                           | Output Type        | क्या देता है?                             |
| ------------------------------ | ------------------ | ----------------------------------------- |
| `visa_df.dtypes`               | Series             | Column → Data type                        |
| `visa_df.dtypes.items()`       | Iterable of tuples | (column, dtype)                           |
| `list(visa_df.dtypes.items())` | List of tuples     | `[('continent', object), ('age', int64)]` |

## Make a Dataframe

In [10]:
pd.DataFrame(visa_df.dtypes)

                             0
case_id                 object
continent               object
education_of_employee   object
has_job_experience      object
requires_job_training   object
no_of_employees          int64
yr_of_estab              int64
region_of_employment    object
prevailing_wage        float64
unit_of_wage            object
full_time_position      object
case_status             object

In [ ]:
Index = column names

Values = हर column का data type
जब आप इसे pd.DataFrame() में डालते हो, तो वो Series को DataFrame में convert कर देता है।

In [14]:
keys=visa_df.dtypes.keys()
values=visa_df.dtypes.values
pd.DataFrame(zip(keys,values),
            columns=['Column name','Data types'])

              Column name Data types
0                 case_id     object
1               continent     object
2   education_of_employee     object
3      has_job_experience     object
4   requires_job_training     object
5         no_of_employees      int64
6             yr_of_estab      int64
7    region_of_employment     object
8         prevailing_wage    float64
9            unit_of_wage     object
10     full_time_position     object
11            case_status     object

- when we have a dictionary
- first makes in keys and values seperate
- then creat a dataframe

### task-1: seprate categorical columns and numerical

In [15]:
dict1={'A':1,
       'B':2,
       'a':3,
       'b':4}
for i,j in dict1.items():
    print(i,j)

A 1
B 2
a 3
b 4

In [16]:
dict1={'A':1,
       'B':2,
       'a':3,
       'b':4}
for i,j in dict1.items():
    if i.isupper():
        print(j)

1
2

In [17]:
dict1={'A':1,
       'B':2,
       'a':3,
       'b':4}
for i,j in dict1.items():
    if i.isupper():
        print(i,j)

A 1
B 2

In [18]:
dict(visa_df.dtypes)

{'case_id': dtype('O'),
 'continent': dtype('O'),
 'education_of_employee': dtype('O'),
 'has_job_experience': dtype('O'),
 'requires_job_training': dtype('O'),
 'no_of_employees': dtype('int64'),
 'yr_of_estab': dtype('int64'),
 'region_of_employment': dtype('O'),
 'prevailing_wage': dtype('float64'),
 'unit_of_wage': dtype('O'),
 'full_time_position': dtype('O'),
 'case_status': dtype('O')}

In [22]:
dtypes=dict(visa_df.dtypes)
cat,num=[],[]
for i ,j in dtypes.items():
    if j=='object':
        cat.append(i)
    else:
        num.append(i)

In [23]:
dtypes=dict(visa_df.dtypes)
cat=[i for i,j in dtypes.items()  if j=='object']
num=[i for i,j in dtypes.items() if j!='object']

In [24]:
cat

['case_id',
 'continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'region_of_employment',
 'unit_of_wage',
 'full_time_position',
 'case_status']

In [25]:
num

['no_of_employees', 'yr_of_estab', 'prevailing_wage']

## select datatype

#### include: कौन-कौन से data types को शामिल करना है (list, string, या None)

exclude: कौन-कौन से data types को हटाना है (list, string, या None)

##### | Code example                         | क्या करता है                                |
| ------------------------------------ | ------------------------------------------- |
| `df.select_dtypes(include='object')` | सिर्फ categorical (string) कॉलम देता है     |
| `df.select_dtypes(include='number')` | सिर्फ numerical (int, float) कॉलम देता है   |
| `df.select_dtypes(exclude='object')` | categorical कॉलम को छोड़ कर बाकी सब देता है |

In [27]:
cat=visa_df.select_dtypes(include='object').columns
cat

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'region_of_employment', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [3]:
# 1. visa_df.select_dtypes(include='object')
# यह DataFrame से सिर्फ वही कॉलम निकालता है जिनका data type 'object' होता है

# यानी ज़्यादातर cases में string/categorical कॉलम

# 2. .columns
# इसका मतलब है: जो DataFrame बचा है, उसके column names को निकाल लो

# 3. cat = ...
# अब ये सारे object-type कॉलम names को एक Index object में store करता है

In [33]:
num=visa_df.select_dtypes(exclude='object').columns
num

Index(['no_of_employees', 'yr_of_estab', 'prevailing_wage'], dtype='object')

In [ ]:
# import the packages
# read the data
# selectdtypes

- take
- loc
- iloc

In [34]:
# select 100,200,300 rows data
rows=[100,200,300]
visa_df.take(rows,axis=0)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
100,EZYV101,Asia,Master's,Y,N,2227,2007,Northeast,28243.79,Year,Y,Certified
200,EZYV201,Asia,Doctorate,Y,N,3282,1979,West,74441.11,Year,Y,Certified
300,EZYV301,Asia,Master's,Y,N,3268,2012,Midwest,101371.21,Year,Y,Certified

###### take() क्या करता है?
take() Pandas का एक method है जो row या column की position (index) से
DataFrame से data निकालने के लिए इस्तेमाल होता है।

In [35]:
visa_df.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [36]:
cols=[1,5]
visa_df.take(cols,axis=1).take(rows,axis=0)

    continent  no_of_employees
100      Asia             2227
200      Asia             3282
300      Asia             3268

- manual counting index of columns
- at a time i can not select rows and columns, we need to do two take

### iloc

- iloc[rows,columns]
- iloc[start:stop:step,start:stop:step]

In [ ]:
visa_df.iloc[[0, 2], [1, 3]]
Rows: 0 और 2

Columns: position 1 (Age) और position 3 (Salary)

###### .iloc[] → "integer-location based indexing" है
यानि आप row और column को position (index number) से select करते हो, नाम से नहीं।

In [ ]:
2. Range से rows और columns:

##### | Code                   | काम                           |
| ---------------------- | ----------------------------- |
| `iloc[2]`              | सिर्फ 3rd row (row 2) देगा    |
| `iloc[:, 1]`           | सारे rows से सिर्फ 2nd column |
| `iloc[1:4, 0:2]`       | rows 1 to 3, columns 0 to 1   |
| `iloc[[0, 2], [1, 3]]` | exact rows और columns         |

In [ ]:
Rows: 0 से 2 (3 से पहले तक)

Columns: 1 से 2 (3 से पहले तक)

In [39]:
visa_df.iloc[1:5,2:5]
#  1:5 → rows 1 से लेकर 4 तक (5 से पहले तक, यानी Python की slicing rule)

# :5 → columns 2 से लेकर 4 तक (5 से पहले तक)

  education_of_employee has_job_experience requires_job_training
1              Master's                  Y                     N
2            Bachelor's                  N                     Y
3            Bachelor's                  N                     N
4              Master's                  Y                     N

In [40]:
visa_df.iloc[1:5,5]

1     2412
2    44444
3       98
4     1082
Name: no_of_employees, dtype: int64

In [41]:
visa_df.iloc[4:2,5]

Series([], Name: no_of_employees, dtype: int64)

In [42]:
visa_df.iloc[4,2:5]

education_of_employee    Master's
has_job_experience              Y
requires_job_training           N
Name: 4, dtype: object

In [43]:
visa_df.iloc[1:5,[2,6,7]] # w

  education_of_employee  yr_of_estab region_of_employment
1              Master's         2002            Northeast
2            Bachelor's         2008                 West
3            Bachelor's         1897                 West
4              Master's         2005                South

In [44]:
visa_df.iloc[[100,200,300],2:5] # w

    education_of_employee has_job_experience requires_job_training
100              Master's                  Y                     N
200             Doctorate                  Y                     N
300              Master's                  Y                     N

#### | Expression       | Output Type | Structure        |
| ---------------- | ----------- | ---------------- |
| `iloc[5, 2:6]`   | `Series`    | 1 row, many cols |
| `iloc[[5], 2:6]` | `DataFrame` | 1 row, many cols |

In [45]:
visa_df.iloc[[100,200,300],[2,6,7]] # w

    education_of_employee  yr_of_estab region_of_employment
100              Master's         2007            Northeast
200             Doctorate         1979                 West
300              Master's         2012              Midwest

visa_df.iloc[...] → index-based selection होती है (number-based, ना कि column names से)

[[100, 200, 300]] → इसका मतलब है कि हम row नंबर 100, 200, और 300 लेना चाहते हैं।

[[2, 6, 7]] → इसका मतलब है कि हम column नंबर 2, 6, और 7 लेना चाहते हैं।

In [46]:
visa_df.iloc[100] # w

case_id                    EZYV101
continent                     Asia
education_of_employee     Master's
has_job_experience               Y
requires_job_training            N
no_of_employees               2227
yr_of_estab                   2007
region_of_employment     Northeast
prevailing_wage           28243.79
unit_of_wage                  Year
full_time_position               Y
case_status              Certified
Name: 100, dtype: object

In [47]:
visa_df.iloc[5,:] # w

case_id                     EZYV06
continent                     Asia
education_of_employee     Master's
has_job_experience               Y
requires_job_training            N
no_of_employees               2339
yr_of_estab                   2012
region_of_employment         South
prevailing_wage           78252.14
unit_of_wage                  Year
full_time_position               Y
case_status              Certified
Name: 5, dtype: object

In [48]:
visa_df.iloc[:,5] #

0        14513
1         2412
2        44444
3           98
4         1082
         ...
25475     2601
25476     3274
25477     1121
25478     1918
25479     3195
Name: no_of_employees, Length: 25480, dtype: int64

In [49]:
# selecting a particular column
visa_df.iloc[:,5] #✅ 1. visa_df.iloc[:, 5]
#यह column नंबर 5 को Series के रूप में return करता है।
#Output का type: pandas.Series

0        14513
1         2412
2        44444
3           98
4         1082
         ...
25475     2601
25476     3274
25477     1121
25478     1918
25479     3195
Name: no_of_employees, Length: 25480, dtype: int64

In [50]:
#visa_df.iloc[[:,5]]
visa_df.iloc[:,[5]]# 2. visa_df.iloc[:, [5]]
#यह भी column नंबर 5 देता है, लेकिन DataFrame के रूप में।
#Output का type: pandas.DataFrame

       no_of_employees
0                14513
1                 2412
2                44444
3                   98
4                 1082
...                ...
25475             2601
25476             3274
25477             1121
25478             1918
25479             3195

[25480 rows x 1 columns]

In [ ]:
visa_df.iloc[:,5] # series
visa_df.iloc[:,[5]] # dataframe

In [51]:
visa_df.iloc[:,'no_of_employees']

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

- take
  - manual counting
  - at a time we can not select rows and columns
- iloc
  - manual counting
- loc

In [ ]:
 .loc[] क्या है?
.loc[] → Label-based indexing है
यानि आप row और column को उनके नाम (labels) से select करते हैं, position (number) से नहीं।

In [52]:
visa_df.loc[:,'no_of_employees']

0        14513
1         2412
2        44444
3           98
4         1082
         ...
25475     2601
25476     3274
25477     1121
25478     1918
25479     3195
Name: no_of_employees, Length: 25480, dtype: int64

In [53]:
visa_df.loc[1:5,<>]

SyntaxError: invalid syntax (4234289617.py, line 1)

In [54]:
visa_df.loc[100]

case_id                    EZYV101
continent                     Asia
education_of_employee     Master's
has_job_experience               Y
requires_job_training            N
no_of_employees               2227
yr_of_estab                   2007
region_of_employment     Northeast
prevailing_wage           28243.79
unit_of_wage                  Year
full_time_position               Y
case_status              Certified
Name: 100, dtype: object

In [55]:
visa_df.loc[5,:]

case_id                     EZYV06
continent                     Asia
education_of_employee     Master's
has_job_experience               Y
requires_job_training            N
no_of_employees               2339
yr_of_estab                   2012
region_of_employment         South
prevailing_wage           78252.14
unit_of_wage                  Year
full_time_position               Y
case_status              Certified
Name: 5, dtype: object

In [56]:
visa_df.loc[:,<>]

SyntaxError: invalid syntax (1595722633.py, line 1)

In [57]:
visa_df.loc[4,2:<>]

SyntaxError: invalid syntax (734239807.py, line 1)

In [58]:
visa_df.loc[1:5,[<>]]

SyntaxError: invalid syntax (2096808284.py, line 1)

In [59]:
visa_df.loc[[100,200,300],:]

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
100,EZYV101,Asia,Master's,Y,N,2227,2007,Northeast,28243.79,Year,Y,Certified
200,EZYV201,Asia,Doctorate,Y,N,3282,1979,West,74441.11,Year,Y,Certified
300,EZYV301,Asia,Master's,Y,N,3268,2012,Midwest,101371.21,Year,Y,Certified

In [60]:
visa_df.loc[[100,200,300],[<>]]

SyntaxError: invalid syntax (312066002.py, line 1)

In [61]:
visa_df.loc[100,<>]

SyntaxError: invalid syntax (3508967971.py, line 1)

In [ ]:
| Feature       | `.iloc[]`                  | `.loc[]`                       |
| ------------- | -------------------------- | ------------------------------ |
| आधारित है     | Row/column **position** पर | Row/column **labels (नाम)** पर |
| Row 1         | `iloc[1]`                  | `loc[1]`                       |
| Column "Age"  | `iloc[:, 1]`               | `loc[:, 'Age']`                |
| Row condition | ❌ (नहीं कर सकते)           | ✅ (कर सकते हैं)                |

###### 🔹 1. Single Row by Label:
python
Copy code
visa_df.loc[1]
➡️ Index label 1 की पूरी row देगा

🔹 2. Specific Rows and Columns:
python
Copy code
visa_df.loc[1, 'Country']
➡️ Index 1 और column 'Country' की value: "USA"

🔹 3. Multiple Rows and Columns:
python
Copy code
visa_df.loc[[0,2], ['Name', 'case_status']]
➡️ Row 0 और 2 से 'Name' और 'case_status' columns

🔹 4. Range (Slicing):
python
Copy code
visa_df.loc[0:2, 'Name':'Country']
➡️ Row 0 से 2 तक और 'Name' से 'Country' तक के सभी columns

🔹 5. Condition के साथ:
python
Copy code
visa_df.loc[visa_df['case_status'] == 'Approved', ['Name', 'Country']]
➡️ सिर्फ वही rows जहाँ case_status "Approved" हो